resources/public/cv/gmarin.org
#+SETUPFILE: template.org

* *Gabriel Marin*
#+ATTR_LATEX: :environment tabular :align {>{\raggedleft}p{2.3cm}|p{14cm}}
| Email    | [[mailto:marin.gabriel@protonmail.com][marin.gabriel@protonmail.com]]            |
| Github   | [[https://github.com/gbrlmarn][github.com/gbrlmarn]]                     |
| Linkedin | [[https://linkedin.com/in/maringabriel][linkedin.com/in/maringabriel]]            |
| Website  | [[https://gbrlmarn.github.io][gbrlmarn.github.io]]                      |
** *Experience*
#+ATTR_LATEX: :environment tabular :align {>{\raggedleft}p{2.3cm}|p{14cm}}
| 2022-Present | *Software Engineer* at Luxoft, Bucharest                           |
|              | Maintained project building environment using CMake.               |
|              | Done socket programming using ZeroMQ library in C/C++.             |
|              | Automated environment configuration using Docker and Bash.         |
|              | Created integration tests using Golang and Clojure.                |
|              | Developed command line interface for sending/receiving messages.   |
|              | Developed certificate viewer in C++ using OpenSSL API.             |
|              | Refactored multiple repositories according to coding guidelines.   |
#+ATTR_LATEX: :environment tabular :align {>{\raggedleft}p{2.3cm}|p{14cm}}
| 2021-2022 | *Software Engineer* at Continental, Sibiu                 |
|           | Worked on XML generator using Java and AUTOSAR library.   |
|           | Converted JSON to XML data using Python.                  |
#+ATTR_LATEX: :environment tabular :align {>{\raggedleft}p{2.3cm}|p{14cm}} 
| 2019-2021 | *System Engineer* at Ministry of Internal Affairs, Rm.Valcea     |
|           | Developed scripts for task automation with PowerShell.           |
|           | Deployed and configured Radius server and Squid proxy.           |
| 2018-2019 | *Middleware Engineer* at Ministry of Internal Affairs, Bucharest |
|           | Provided layer 1 support.                                        |
|           | Managed users access in Oracle SQL database.                     |

** *Education*
#+ATTR_LATEX: :environment tabular :align {>{\raggedleft}p{2.3cm}|p{14cm}}
| 2018-2020 | *Master's in Telecommunications Engineering*   |
|           | Military Technical Academy, Bucharest          |
| 2014-2018 | *Bachelor's in Telecommunications Engineering* |
|           | Military Technical Academy, Bucharest          |
** *Skills*
*** *Programming Languages*
#+ATTR_LATEX: :environment tabular :align {>{\raggedleft}p{2.3cm}|p{14cm}}
| ●●●●○ | C/C++, Go, Clojure                               |
| ●●●○○ | Python, Java, JavaScript, Rust, SQL, Lisp, Bash  |
| ●○○○○ | Elixir, Erlang, Perl, Ruby, PowerShell           |
*** *Tools*
#+ATTR_LATEX: :environment tabular :align {>{\raggedleft}p{2.3cm}|p{14cm}}
| ●●●●○ | Linux, Emacs, Coreutils, Git, CMake, Vim, Tmux, Org, LaTeX     |
| ●●●○○ | Docker, Make, ZeroMQ, Hugo, Leiningen, Babashka, Guix, Datomic |
| ●○○○○ | HTML/CSS, Django, React, Maven, PlantUML, Terraform, RabbitMQ  |
*** *Languages*
#+ATTR_LATEX: :environment tabular :align {>{\raggedleft}p{2.3cm}|p{14cm}}
| ●●●●● | Romanian |
| ●●●●○ | English  |
| ●●●○○ | Italian  |
