resources/public/cv/gmarin.tex
% Created 2024-08-10 Sat 21:17
% Intended LaTeX compiler: xelatex
\documentclass[a4paper,12pt]{article}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{unicode-math}
\usepackage{fontspec}
\setmainfont{Times New Roman}
\pagenumbering{gobble}
\usepackage[big]{layaureo} % better A4 formating
\usepackage{titlesec} % custom \section
\usepackage{url,parskip} % packages for formating
\usepackage{multicol} % multiples columns
\usepackage{ragged2e} % for alignment
\usepackage{color}
\usepackage{graphicx}
\usepackage{svg}
\usepackage{hyperref}
\usepackage{array} % for table alignment
\definecolor{linkcolour}{rgb}{0,0.2,0.6}
\hypersetup{colorlinks,breaklinks,urlcolor=linkcolour, linkcolor=linkcolour}
\titleformat{\section}{\LARGE\scshape\raggedright}{\thesection}{1em}{}
\titlespacing{\section}{0pt}{4pt}{4pt}
\setlength{\columnsep}{1cm} % space between columns
\titleformat{\subsection}{\large\scshape\raggedright}{\thesubsection}{1em}{}
\titlespacing{\subsection}{0pt}{1pt}{1pt}
\titleformat{\subsubsection}{\normalsize\scshape\raggedright}{\thesubsubsection}{1em}{}
\titlespacing{\subsubsection}{0pt}{1pt}{1pt}
\date{}
\title{}
\hypersetup{
 pdfauthor={DESKTOP-8LGKRKH},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.6.15)}, 
 pdflang={English}}
\begin{document}


\section*{\textbf{Gabriel Marin}}
\label{sec:org7e6532c}
\begin{center}
\begin{tabular}{{>{\raggedleft}p{2.3cm}|p{14cm}}}
Email & \href{mailto:marin.gabriel@protonmail.com}{marin.gabriel@protonmail.com}\\[0pt]
Github & \href{https://github.com/gbrlmarn}{github.com/gbrlmarn}\\[0pt]
Linkedin & \href{https://linkedin.com/in/maringabriel}{linkedin.com/in/maringabriel}\\[0pt]
Website & \href{https://gbrlmarn.github.io}{gbrlmarn.github.io}\\[0pt]
\end{tabular}
\end{center}
\subsection*{\textbf{Experience}}
\label{sec:orgbda2f3b}
\begin{center}
\begin{tabular}{{>{\raggedleft}p{2.3cm}|p{14cm}}}
2022-Present & \textbf{Software Engineer} at Luxoft, Bucharest\\[0pt]
 & Maintained project building environment using CMake.\\[0pt]
 & Done socket programming using ZeroMQ library in C/C++.\\[0pt]
 & Automated environment configuration using Docker and Bash.\\[0pt]
 & Created integration tests using Golang and Clojure.\\[0pt]
 & Developed command line interface for sending/receiving messages.\\[0pt]
 & Developed certificate viewer in C++ using OpenSSL API.\\[0pt]
 & Refactored multiple repositories according to coding guidelines.\\[0pt]
\end{tabular}
\end{center}
\begin{center}
\begin{tabular}{{>{\raggedleft}p{2.3cm}|p{14cm}}}
2021-2022 & \textbf{Software Engineer} at Continental, Sibiu\\[0pt]
 & Worked on XML generator using Java and AUTOSAR library.\\[0pt]
 & Converted JSON to XML data using Python.\\[0pt]
\end{tabular}
\end{center}
\begin{center}
\begin{tabular}{{>{\raggedleft}p{2.3cm}|p{14cm}}}
2019-2021 & \textbf{System Engineer} at Ministry of Internal Affairs, Rm.Valcea\\[0pt]
 & Developed scripts for task automation with PowerShell.\\[0pt]
 & Deployed and configured Radius server and Squid proxy.\\[0pt]
2018-2019 & \textbf{Middleware Engineer} at Ministry of Internal Affairs, Bucharest\\[0pt]
 & Provided layer 1 support.\\[0pt]
 & Managed users access in Oracle SQL database.\\[0pt]
\end{tabular}
\end{center}

\subsection*{\textbf{Education}}
\label{sec:orgc03bfd0}
\begin{center}
\begin{tabular}{{>{\raggedleft}p{2.3cm}|p{14cm}}}
2018-2020 & \textbf{Master's in Telecommunications Engineering}\\[0pt]
 & Military Technical Academy, Bucharest\\[0pt]
2014-2018 & \textbf{Bachelor's in Telecommunications Engineering}\\[0pt]
 & Military Technical Academy, Bucharest\\[0pt]
\end{tabular}
\end{center}
\subsection*{\textbf{Skills}}
\label{sec:org43b2333}
\subsubsection*{\textbf{Programming Languages}}
\label{sec:org5c79f54}
\begin{center}
\begin{tabular}{{>{\raggedleft}p{2.3cm}|p{14cm}}}
●●●●○ & C/C++, Go, Clojure\\[0pt]
●●●○○ & Python, Java, JavaScript, Rust, SQL, Lisp, Bash\\[0pt]
●○○○○ & Elixir, Erlang, Perl, Ruby, PowerShell\\[0pt]
\end{tabular}
\end{center}
\subsubsection*{\textbf{Tools}}
\label{sec:orge29ec40}
\begin{center}
\begin{tabular}{{>{\raggedleft}p{2.3cm}|p{14cm}}}
●●●●○ & Linux, Emacs, Coreutils, Git, CMake, Vim, Tmux, Org, \LaTeX{}\\[0pt]
●●●○○ & Docker, Make, ZeroMQ, Hugo, Leiningen, Babashka, Guix, Datomic\\[0pt]
●○○○○ & HTML/CSS, Django, React, Maven, PlantUML, Terraform, RabbitMQ\\[0pt]
\end{tabular}
\end{center}
\subsubsection*{\textbf{Languages}}
\label{sec:orga9df1a5}
\begin{center}
\begin{tabular}{{>{\raggedleft}p{2.3cm}|p{14cm}}}
●●●●● & Romanian\\[0pt]
●●●●○ & English\\[0pt]
●●●○○ & Italian\\[0pt]
\end{tabular}
\end{center}
\end{document}
